//////////////////////////////////////////////////////////////
//                                                          //
//  أو سكربت يعمل على دومين معين php تجعل من صفحة php كود             //
//                                                          //
//////////////////////////////////////////////////////////////
$rtv = $_SERVER['HTTP_HOST']; // دالة استخراج دومين الموقع
$rtv1 = $_SERVER['REQUEST_URI']; // دالة استخراج المسار الحالي للملف المتصفح
$rtv2 = "*****.com"; // www اكتب دومين الموقع بدون
$rtv3 = "www.*****.com"; // www اكتب دومين الموقع مع
$rtv4 = "*****@gmail.com"; // هنا ضع إميل المبرمج أو رابط للإتصال بك
$mailgust = "*****@gmail.com"; // البريد الالكتروني الدي سيصلك فيه التبليغ
///////////////////////////////////////////////////////////////////////
if ( getenv('HTTP_HOST') != "$rtv2" AND getenv('HTTP_HOST') != "$rtv3"  )
{
// $subject عنوان الرسالة البريدية
$subject = "تم تركيب السكربت   من موقع  ";
// $message نص الرسالة
$message = "
<p align='center'><b><font color='#FF0000'>
تم تركيب نسخة من السكريبت على هذاالموقع </font></b></p>
<p align='center'><a href='$rtv'>$rtv</a></p>
<p align='center'><b><font color='#FF0000'>و ذالك على المسار التالي</font></b></p>
<p align='center'>$rtv<span lang='fr'> $rtv1</span></p>
";
// دالة ارسال البريد
$headers = "From: "."{$mailscript}\r\n"."Reply-To: "."{$mailscript}\r\n"."X-Mailer: PHP/".phpversion( );
@mail( $mailgust, $subject, $message, $headers );
// نص رسالة التحذير التي تظهر لمنتهك الحقوق
die("<p align='center'>
<a href='ضع رابط موقعك هنا/'><img src='ضع رابط لصورة التحذيرهنا'/></a><br><br>
<b><font color='#FF0000' face='droid arabic kufi'><span lang='ar-dz'>&#1575;&#1578;&#1602;&#1610; &#1575;&#1604;&#1604;&#1607; &#1601;&#1610;&#1605;&#1575; &#1578;&#1601;&#1593;&#1604;</span></font></b></p>
<p align='center'><font color='#FF0000' face='droid arabic kufi'><b>&#1571;&#1606;&#1578; &#1578;&#1587;&#1578;&#1593;&#1605;&#1604; &#1606;&#1587;&#1582;&#1577; &#1594;&#1610;&#1585; &#1605;&#1585;&#1582;&#1589;&#1577; &#1604;&#1603; &#1605;&#1606; &#1607;&#1583;&#1575; &#1575;&#1604;&#1587;&#1603;&#1585;&#1576;&#1578; &#1593;&#1604;&#1609; &#1605;&#1608;&#1602;&#1593;&#1603; &#1610;&#1580;&#1576; &#1593;&#1604;&#1610;&#1603; &#1575;&#1604;&#1581;&#1589;&#1608;&#1604; &#1593;&#1604;&#1609; &#1578;&#1585;&#1582;&#1610;&#1589; &#1604;&#1603;&#1610; &#1610;&#1593;&#1605;&#1604; &#1575;&#1604;&#1587;&#1603;&#1585;&#1576;&#1578; &#1593;&#1604;&#1609; &#1605;&#1608;&#1602;&#1593;&#1603;</b></font></p>
<p align='center'><font color='#FF0000' face='droid arabic kufi'><b><a target='_blank' href='$rtv4'>$rtv4</a> : &#1575;&#1604;&#1605;&#1585;&#1580;&#1608; &#1604;&#1573;&#1578;&#1589;&#1575;&#1604; &#1576;&#1606;&#1575; &#1604;&#1581;&#1580;&#1586; &#1606;&#1587;&#1582;&#1578;&#1603; &#1605;&#1606; &#1575;&#1604;&#1587;&#1603;&#1585;&#1576;&#1578;</b></font></p>
");
}
